%% Оцінка якість музичний сигналу, що прийнятий масивом мікрофонів

%   Розробник: аспирант Котвицький І. В.
tic
clear
fs = 44100;
          
       disp('Прослуховування сигналу 1');
       
        pause(0.5) 
             snd=audioread('cleanmusic.wav');
        sound(snd, fs);

    pause(10) 
         g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(1)=g;
    
     disp('Прослуховування сигналу 2');
           pause(0.5) 
             snd=audioread('10dB/Array_15.wav');
        sound(snd, fs);
    pause(10) 
  g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(2)=g;
    
        disp('Прослуховування сигналу 3');
          pause(0.5) 
             snd=audioread('10dB/cbfOut_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(3)=g;

      disp('Прослуховування сигналу 4');
          pause(0.5) 
             snd=audioread('10dB/LCMVout1_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(4)=g;
    
     disp('Прослуховування сигналу 5');
          pause(0.5) 
             snd=audioread('10dB/LCMVout2_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(5)=g;
    
     disp('Прослуховування сигналу 6');
          pause(0.5) 
             snd=audioread('10dB/LCMVout3_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(6)=g;
    
     disp('Прослуховування сигналу 7');
          pause(0.5) 
             snd=audioread('10dB/LCMVout4_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB10(7)=g;
    
     %% 0 дБ
          
       disp('Прослуховування сигналу 8');
       
        pause(0.5) 
             snd=audioread('cleanmusic.wav');
        sound(snd, fs);

    pause(10) 
         g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(1)=g;
    
     disp('Прослуховування сигналу 9');
           pause(0.5) 
             snd=audioread('0dB/Array_15.wav');
        sound(snd, fs);
    pause(10) 
  g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(2)=g;
    
        disp('Прослуховування сигналу 10');
          pause(0.5) 
             snd=audioread('0dB/cbfOut_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(3)=g;

      disp('Прослуховування сигналу 11');
          pause(0.5) 
             snd=audioread('0dB/LCMVout1_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(4)=g;
    
     disp('Прослуховування сигналу 12');
          pause(0.5) 
             snd=audioread('0dB/LCMVout2_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(5)=g;
    
     disp('Прослуховування сигналу 13');
          pause(0.5) 
             snd=audioread('0dB/LCMVout3_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(6)=g;
    
     disp('Прослуховування сигналу 14');
          pause(0.5) 
             snd=audioread('0dB/LCMVout4_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dB0(7)=g;
     
     %% -10 дБ
     
   
       disp('Прослуховування сигналу 15');
       
        pause(0.5) 
             snd=audioread('cleanmusic.wav');
        sound(snd, fs);

    pause(10) 
         g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(1)=g;
    
     disp('Прослуховування сигналу 16');
           pause(0.5) 
             snd=audioread('-10dB/Array_15.wav');
        sound(snd, fs);
    pause(10) 
  g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(2)=g;
    
        disp('Прослуховування сигналу 17');
          pause(0.5) 
             snd=audioread('-10dB/cbfOut_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(3)=g;

      disp('Прослуховування сигналу 18');
          pause(0.5) 
             snd=audioread('-10dB/LCMVout1_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(4)=g;
    
     disp('Прослуховування сигналу 19');
          pause(0.5) 
             snd=audioread('-10dB/LCMVout2_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(5)=g;
    
     disp('Прослуховування сигналу 20');
          pause(0.5) 
             snd=audioread('-10dB/LCMVout3_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(6)=g;
    
     disp('Прослуховування сигналу 21');
          pause(0.5) 
             snd=audioread('-10dB/LCMVout4_15.wav');
        sound(snd, fs);
   pause(10) 
    g=input('Введіть оцінку від 1 до 5 (можна не цілу): ');   %считывание оценки с командного окна
    dBm10(7)=g;
    
        %% запис результатів у файл  
    b=input('Введіть латиницею ваше прізвище (в лапках): ');
d=[b, '_15'];
save(d,'dB10', 'dB0', 'dBm10'); 
 
    %% побудова діаграм
    figure
    stem(dB10); grid; ylabel('DMOS'); xlabel('Тип обробки'); title('Співвідношення сигнал/шум 10 дБ');
     figure
    stem(dB0); grid; ylabel('DMOS'); xlabel('Тип обробки'); title('Співвідношення сигнал/шум 0 дБ');
     figure
    stem(dBm10); grid; ylabel('DMOS'); xlabel('Тип обробки'); title('Співвідношення сигнал/шум -10 дБ');
    
 toc



